### Pandas
- Pandas is a python library used for data manipulation and analysis
- A pandas Series is a one-D labeled array that can hold any data type. It is like a column in a DataFrame and each of its element is associated with an index.
- DataFrame is a 2-dimensional labeled data structure with columns of potentially different types and nows.

In [2]:
import pandas as pd

In [3]:
# creating a series from a list
D = [ i for i in range (1, 11)]

In [4]:
D

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [5]:
v = pd.Series(D)

In [6]:
v

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [7]:
v = pd.Series(D, index =['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])

In [8]:
v

a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64

In [9]:
v['e'] - v['c']

2

In [10]:
v.describe()

count    10.00000
mean      5.50000
std       3.02765
min       1.00000
25%       3.25000
50%       5.50000
75%       7.75000
max      10.00000
dtype: float64

In [11]:
# creating a dataframe from a dict

dsc ={"Name": ["Kola Kola", "Abiodun Isaiah", "Iretiogo Toluwani", "Victor Ojo", "Tope Adejare"],
      "Gender":["M", "M", "F", "M", "M"],
      "Age" :[35,32,45,28,26],
      "Location" :["Abuja", "Ibadan", "Lagos", "Kano", "Jos"],
      "Religion" :["Christian", "Musilim", "Budduh", "Christain ", "Christain"]}

In [12]:
dsc

{'Name': ['Kola Kola',
  'Abiodun Isaiah',
  'Iretiogo Toluwani',
  'Victor Ojo',
  'Tope Adejare'],
 'Gender': ['M', 'M', 'F', 'M', 'M'],
 'Age': [35, 32, 45, 28, 26],
 'Location': ['Abuja', 'Ibadan', 'Lagos', 'Kano', 'Jos'],
 'Religion': ['Christian', 'Musilim', 'Budduh', 'Christain ', 'Christain']}

In [13]:
B = pd.DataFrame(dsc)

In [14]:
B

                Name Gender  Age Location    Religion
0          Kola Kola      M   35    Abuja   Christian
1     Abiodun Isaiah      M   32   Ibadan     Musilim
2  Iretiogo Toluwani      F   45    Lagos      Budduh
3         Victor Ojo      M   28     Kano  Christain
4       Tope Adejare      M   26      Jos   Christain

In [15]:
B.head()

                Name Gender  Age Location    Religion
0          Kola Kola      M   35    Abuja   Christian
1     Abiodun Isaiah      M   32   Ibadan     Musilim
2  Iretiogo Toluwani      F   45    Lagos      Budduh
3         Victor Ojo      M   28     Kano  Christain
4       Tope Adejare      M   26      Jos   Christain

In [16]:
B.tail(2)

           Name Gender  Age Location    Religion
3    Victor Ojo      M   28     Kano  Christain
4  Tope Adejare      M   26      Jos   Christain

In [17]:
B.sample()

             Name Gender  Age Location Religion
1  Abiodun Isaiah      M   32   Ibadan  Musilim

In [18]:
B.count()

Name        5
Gender      5
Age         5
Location    5
Religion    5
dtype: int64

In [19]:
len(B)

5

In [20]:
B.columns

Index(['Name', 'Gender', 'Age', 'Location', 'Religion'], dtype='object')

In [21]:
B.Name

0            Kola Kola
1       Abiodun Isaiah
2    Iretiogo Toluwani
3           Victor Ojo
4         Tope Adejare
Name: Name, dtype: object

In [22]:
B["Name"]

0            Kola Kola
1       Abiodun Isaiah
2    Iretiogo Toluwani
3           Victor Ojo
4         Tope Adejare
Name: Name, dtype: object

In [23]:
B.shape

(5, 5)

In [24]:
B.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      5 non-null      object
 1   Gender    5 non-null      object
 2   Age       5 non-null      int64
 3   Location  5 non-null      object
 4   Religion  5 non-null      object
dtypes: int64(1), object(4)
memory usage: 328.0+ bytes

In [25]:
B.describe()

             Age
count   5.000000
mean   33.200000
std     7.463243
min    26.000000
25%    28.000000
50%    32.000000
75%    35.000000
max    45.000000

In [26]:
B.describe().T

     count  mean       std   min   25%   50%   75%   max
Age    5.0  33.2  7.463243  26.0  28.0  32.0  35.0  45.0

In [27]:
B["Join"] = [1, 2, 3, 4, 5]

In [28]:
B

                Name Gender  Age Location    Religion  Join
0          Kola Kola      M   35    Abuja   Christian     1
1     Abiodun Isaiah      M   32   Ibadan     Musilim     2
2  Iretiogo Toluwani      F   45    Lagos      Budduh     3
3         Victor Ojo      M   28     Kano  Christain      4
4       Tope Adejare      M   26      Jos   Christain     5

In [29]:
B["Gender"] = B["Gender"].replace("F", "Female").replace("M", "Male")

In [30]:
B

                Name  Gender  Age Location    Religion  Join
0          Kola Kola    Male   35    Abuja   Christian     1
1     Abiodun Isaiah    Male   32   Ibadan     Musilim     2
2  Iretiogo Toluwani  Female   45    Lagos      Budduh     3
3         Victor Ojo    Male   28     Kano  Christain      4
4       Tope Adejare    Male   26      Jos   Christain     5

In [31]:
B.rename(columns = {"Name": "Full Name"})

           Full Name  Gender  Age Location    Religion  Join
0          Kola Kola    Male   35    Abuja   Christian     1
1     Abiodun Isaiah    Male   32   Ibadan     Musilim     2
2  Iretiogo Toluwani  Female   45    Lagos      Budduh     3
3         Victor Ojo    Male   28     Kano  Christain      4
4       Tope Adejare    Male   26      Jos   Christain     5

In [32]:
B

                Name  Gender  Age Location    Religion  Join
0          Kola Kola    Male   35    Abuja   Christian     1
1     Abiodun Isaiah    Male   32   Ibadan     Musilim     2
2  Iretiogo Toluwani  Female   45    Lagos      Budduh     3
3         Victor Ojo    Male   28     Kano  Christain      4
4       Tope Adejare    Male   26      Jos   Christain     5

In [33]:
B.rename(columns = {"Name": "Full Name"}, inplace = True)

In [34]:
B

           Full Name  Gender  Age Location    Religion  Join
0          Kola Kola    Male   35    Abuja   Christian     1
1     Abiodun Isaiah    Male   32   Ibadan     Musilim     2
2  Iretiogo Toluwani  Female   45    Lagos      Budduh     3
3         Victor Ojo    Male   28     Kano  Christain      4
4       Tope Adejare    Male   26      Jos   Christain     5

## Indexing - selection rows ad columns from DataFrame or series using iloc[] and loc[].
    Iloc[] for postioned indexing selects data based on integer- based positions. Exclusive of the end index.
    
    loc[](Label Location) for label based indexing allows selecting rows and columns based on labels indusive of the end index

In [35]:
B.iloc[0,]

Full Name    Kola Kola
Gender            Male
Age                 35
Location         Abuja
Religion     Christian
Join                 1
Name: 0, dtype: object

In [36]:
B.iloc[0,4]

'Christian'

In [37]:
B.iloc[0:3]

           Full Name  Gender  Age Location   Religion  Join
0          Kola Kola    Male   35    Abuja  Christian     1
1     Abiodun Isaiah    Male   32   Ibadan    Musilim     2
2  Iretiogo Toluwani  Female   45    Lagos     Budduh     3

In [38]:
B.iloc[0:3, 4]

0    Christian
1      Musilim
2       Budduh
Name: Religion, dtype: object

In [39]:
B.iloc[0:3, :4]

           Full Name  Gender  Age Location
0          Kola Kola    Male   35    Abuja
1     Abiodun Isaiah    Male   32   Ibadan
2  Iretiogo Toluwani  Female   45    Lagos

In [43]:
B.iloc[0:3, 1:3]

   Gender  Age
0    Male   35
1    Male   32
2  Female   45

In [44]:
B.iloc[0:3, :3]

           Full Name  Gender  Age
0          Kola Kola    Male   35
1     Abiodun Isaiah    Male   32
2  Iretiogo Toluwani  Female   45

In [45]:
B.iloc[0:3, 2:]

   Age Location   Religion  Join
0   35    Abuja  Christian     1
1   32   Ibadan    Musilim     2
2   45    Lagos     Budduh     3

In [46]:
B.iloc[:4, :2]

           Full Name  Gender
0          Kola Kola    Male
1     Abiodun Isaiah    Male
2  Iretiogo Toluwani  Female
3         Victor Ojo    Male

In [47]:
B.loc[1:3, {"Gender", "Join"}]

C:\Users\Opsydee\AppData\Local\Temp\ipykernel_11608\67651189.py:1: FutureWarning: Passing a set as an indexer is deprecated and will raise in a future version. Use a list instead.
  B.loc[1:3, {"Gender", "Join"}]

   Gender  Join
1    Male     2
2  Female     3
3    Male     4

In [48]:
B.loc[B["Age"] >29] #condditional filtering

           Full Name  Gender  Age Location   Religion  Join
0          Kola Kola    Male   35    Abuja  Christian     1
1     Abiodun Isaiah    Male   32   Ibadan    Musilim     2
2  Iretiogo Toluwani  Female   45    Lagos     Budduh     3

In [49]:
B.loc[B["Full Name"] == "Iretiogo Toluwani"]

           Full Name  Gender  Age Location Religion  Join
2  Iretiogo Toluwani  Female   45    Lagos   Budduh     3

In [50]:
B[(B["Age"] > 29) &(B["Join"]>2)]

           Full Name  Gender  Age Location Religion  Join
2  Iretiogo Toluwani  Female   45    Lagos   Budduh     3

In [51]:
B[(B["Age"] > 29) | (B["Join"]>2)]

           Full Name  Gender  Age Location    Religion  Join
0          Kola Kola    Male   35    Abuja   Christian     1
1     Abiodun Isaiah    Male   32   Ibadan     Musilim     2
2  Iretiogo Toluwani  Female   45    Lagos      Budduh     3
3         Victor Ojo    Male   28     Kano  Christain      4
4       Tope Adejare    Male   26      Jos   Christain     5

In [55]:
print(pd.options.display.max_rows)

60

In [56]:
pd.options.display.max_rows = 60